---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.ForwardIterator
source: html/cda4b2a7-c49c-a1a8-bda2-e89bb780fe6a.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CorrectionFactorSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.